---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ParameterFilterRuleFactory
source: html/e6646480-b0ce-b299-3996-e965c913f9c4.htm
---
# ParameterFilterRuleFactory Members

Creates a filter rule that determines whether strings from the document
 begin with a certain string value.